# DisconnectPanel Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSystem..::..DisconnectPanel Method
ElectricalSystem Class See Also
---
Disconnect the panel for the Electrical System.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void DisconnectPanel()
```

Visual Basic
---
```text
Public Sub DisconnectPanel
```

Visual C++
---
```text
public:
void DisconnectPanel()
```

# Remarks
If successful, the system will disconnect this panel. Otherwise the exception will be thrown. This method will only function with the Autodesk Revit MEP application.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Mechanical Electrical Piping. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the panel cannot be disconnected for the electrical system. |

# See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace